{
  "Give up 'failed path' of armed struggle, join mainstream: Surrendered Naxal Bhupathi to comradesTop Naxalite Mallojula Venugopal Rao alias Bhupathi surrendered to Gadchiroli police. He appealed to active comrades to lay down arms and join the mainstream. Bhupathi stated that armed struggle has moved them away from people. He urged Maoists to leave viole…": {
    "show": true,
    "topic": "geopolitics",
    "importance": 3
  },
  "Woman Aghast as 14 Data Centers Move Next Door, Emits Terrible Stench\"I will die on this hill and stay in this house.\"\nThe post Woman Aghast as 14 Data Centers Move Next Door, Emits Terrible Stench appeared first on Futurism.": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "Overton Window Speedrun: British Voters Now More Right-Wing on Immigration Than AmericansVoters across the political spectrum in the UK are more likely to hold strong views on immigration and ethnic homogeneity than Americans.\nThe post Overton Window Speedrun: British Voters Now More Right-Wing on Immigration Than Americans appeared first on Brei…": {
    "show": true,
    "topic": "geopolitics",
    "importance": 4
  },
  "Nvidia emerges as TSMC's first A16 customer, while Apple may skip to A14Taiwan Semiconductor Manufacturing Company (TSMC) plans to launch its latest 1.6nm process, dubbed A16, in 2027. Reports indicate that Nvidia is currently working with TSMC on testing the A16 technology and is poised to become its inaugural adopter. In contra…": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "US urges ASEAN to be firm in countering China in the South China SeaU.S. Defense Secretary Pete Hegseth on Saturday urged Southeast Asian nations to stand firm and strengthen their maritime forces to counter China’s...": {
    "show": true,
    "topic": "geopolitics",
    "importance": 5
  },
  "I'm the CEO behind the New York Marathon. Here's how we pull off the world's biggest race.Rob Simmelkjaer, CEO of the nonprofit that puts on the New York City Marathon, said it's a miracle how the race comes together every year.": {
    "show": false,
    "topic": "other",
    "importance": 1
  },
  "Asean reaffirms 'no nukes' stance, says Defence MinisterKUALA LUMPUR: Asean reaffirms its no nuclear stance, says Datuk Seri Mohamed Khaled Nordin. Read full story": {
    "show": true,
    "topic": "geopolitics",
    "importance": 4
  },
  "Housing market inventory shift: 17 states where buyers are winning back powerWant more housing market stories from Lance Lambert’s ResiClub in your inbox? Subscribe to the ResiClub newsletter.\nWhen assessing home price momentum, ResiClub believes it’s important to monitor active listings and months of supply. If active listings start …": {
    "show": false,
    "topic": "other",
    "importance": 1
  },
  "BYD's October vehicle sales down 12% from year earlier": {
    "show": true,
    "topic": "tech",
    "importance": 2
  },
  "IonQ: Quantum Progress Meets Market RealityWhen I first analyzed IonQ (IONQ) it was a scientific frontrunner still searching for commercial validation. Since then, the stock has surged 113%, reflecting growing conviction in its execution and financial strength. The company raised 2025 guidance\nSummary…": {
    "show": false,
    "topic": "tech",
    "importance": 3
  },
  "Jamaican town reduced to rubble by Hurricane MelissaParadise turned to devastation The once-vibrant coastal town of Black River, Jamaica, has been transformed into what survivors are calling hell on Earth after Hurricane Melissa tore through the community with catastrophic force. The tropical paradise known fo…": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "Taiwan’s quantum talent gap widens as Dutch model highlights what’s missingAt a seminar held on April 28, 2025, by Taiwan's Industrial Technology Research Institute (ITRI), experts highlighted the stark contrast in quantum talent development and industry application between Taiwan and the Netherlands. Jeff Lin, general director of I…": {
    "show": true,
    "topic": "tech",
    "importance": 4
  },
  "BYD's October vehicle sales down 12% from year earlierBEIJING :Chinese automaker BYD said on Saturday its October sales dropped 12 per cent from the same month a year earlier to 441,706 vehicles.The update on global deliveries came in a post on Weibo by a BYD executive in charge of marketing and public relations…": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "This Simple Habit Can Improve Focus & Concentration, Study FindsPssst.... it's enjoyable, too.": {
    "show": false,
    "topic": "social",
    "importance": 1
  },
  "China signals easing of Nexperia chip export ban after talks with US, EU“We will comprehensively assess each enterprise’s specific circumstances and grant exemptions to those that meet the eligibility criteria,” the MOFCOM said on Saturday": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "Foreign Secretary speech at the 21st Manama Dialogue Conference in BahrainThe Foreign Secretary delivered a speech at the 21st Manama Dialogue Conference in Bahrain": {
    "show": true,
    "topic": "geopolitics",
    "importance": 4
  },
  "Taiwan analytics firm wins Canadian telecom deal, marking North American debutTaiwan's mobile data analytics firm Groundhog Technologies has successfully entered the North American market in the fourth quarter of 2025 by securing a contract with a leading Canadian telecom operator. The company continues to strengthen its presence in Ja…": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "Dalal Street Week Ahead: Technical charts signal bullish bias despite mild fatigueIndian markets traded rangebound last week, ending slightly lower. The Nifty broke a long-term trendline but faces resistance.  A truncated week ahead may see consolidation.  PSU Bank and Metal sectors are outperforming.  Participants should remain selectivel…": {
    "show": false,
    "topic": "finance",
    "importance": 2
  },
  "National Library prepares materials on nutrition to support MBGThe Indonesia National Library (Perpusnas) is preparing reading materials on nutrition to support national literacy improvement through the Free Nutritious ...": {
    "show": false,
    "topic": "other",
    "importance": 1
  },
  "Linux 6.18 Kernel Happenings, Python 3.14, NTFSPLUS & Other October HighlightsDuring the month of October on Phoronix were 305 original news articles around Linux/open-source and another 21 featured Linux hardware reviews / multi-page featured benchmark articles. There was an exciting mix of software and hardware happenings over the pa…": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "F&O Talk| Nifty logs 11 sessions of tight moves post 1,500-point rally. Here are the key levels Sudeep Shah is eyeingMarkets ended lower after a four-week rally due to profit-booking and mixed global signals. While broader indices showed strength, sectors like Auto and IT faced pressure. Analysts suggest PSU Banks, Oil & Gas, and Realty are poised for outperformance, with s…": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "NES Friday the 13th and NECA in The Daily LITG, 1st November, 2025NES Friday the 13th and NECA was the most-read story on Bleeding Cool yesterday, yet again. Lying In The Gutters is the daily runaround for the most-read stories the day before, as well as over the past seven years. Founded over sixteen years ago and steeped …": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "orq-ai-sdk 3.14.7Python Client SDK for the Orq API.": {
    "show": false,
    "topic": "tech",
    "importance": 1
  },
  "Inflation Rises in Turkey’s Biggest City Ahead of National Data": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "China's Xi pushes for global AI body at APEC in counter to U.S. - CNBCChina's Xi pushes for global AI body at APEC in counter to U.S.CNBC South Korea's Lee asks China's Xi for help engaging North KoreaNBC News APEC leaders wrap up summit after Trump and Xi reach truce in trade warAl Jazeera Xi, Lee Will Hold Talks in South Kore…": {
    "show": true,
    "topic": "geopolitics",
    "importance": 5
  },
  "On the island of Belene, Bulgarian communism’s forgotten prisonOn the Danube, between Bulgaria and Romania, Belene island once housed a prison camp for opponents of the Bulgarian Communist Party. Today, the island is home to an ordinary prison as well as a nature park – and what remains of some long-repressed memories.": {
    "show": true,
    "topic": "social",
    "importance": 2
  },
  "China signals easing of Nexperia semiconductor export ban - Financial TimesChina signals easing of Nexperia semiconductor export banFinancial Times China to loosen chip export ban to Europe following Netherlands rowBBC US to Announce Nexperia Chip Shipments From China to ResumeBloomberg Nexperia’s Chinese owner demands ousted CEO be…": {
    "show": true,
    "topic": "tech",
    "importance": 4
  },
  "US trade pact does not force M'sia into blind compliance, says Tengku ZafrulSHAH ALAM: The Reciprocal Trade Agreement (ART) between Malaysia and the United States (US) does not compel Malaysia to comply blindly, says Tngku Datuk Seri Zafrul Abdul Aziz, contradicting claims by Tan Sri Muhyiddin Yassin that it would force the country i…": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "Pet Health Products Market, By ApplicationSouth Korea Pet Health Products Market was valued at USD 1.2 Billion in 2022 and is projected to reach USD 2.": {
    "show": false,
    "topic": "other",
    "importance": 1
  },
  "The Brokerage That Makes More From Fewer Clients: Is Interactive Brokers Still Undervalued?With record equity, rising margin balances, and elite client engagement, Interactive Brokers continues to scale its model.": {
    "show": true,
    "topic": "finance",
    "importance": 4
  },
  "Man narrowly avoids disaster as 'one-in-a-billion' meteorite smashes into windscreen while driving brand new TeslaAustralian vet Dr Andrew Melville-Smith was driving his new Tesla home when a 'really violent explosion' rocked the car, burning a hole in his windcreen.": {
    "show": false,
    "topic": "disaster",
    "importance": 1
  },
  "Public school districts coast to coast adopting radical curriculum from org named for 60s radicalControversial Zinn Education Project curriculum adopted by 176,000+ teachers nationwide teaches American history through lens of racial oppression in public schools.": {
    "show": true,
    "topic": "social",
    "importance": 4
  },
  "Carney says he told Ontario premier not to run anti-tariff ad, apologized to TrumpGYEONGJU - Prime Minister Mark Carney says he told Ontario Premier Doug Ford that he didn't think the province should run the ad campaign that's being blamed for ending trade": {
    "show": true,
    "topic": "geopolitics",
    "importance": 3
  },
  "US offer of assistance to Asean must be based on ADMM frameworkKUALA LUMPUR: The United States' offer of cooperation to Asean must be based on the Asean Defence Ministers Meeting (ADMM) framework and the regional bloc centrality, says Datuk Seri Mohamed Khaled Nordin. Read full story": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "India’s net GST collection stays flat in October; gross up 4.6%The subdued growth reflects the impact of GST rate cuts effective September 22, following Prime Minister Modi’s August 15 announcement, which prompted consumers to delay purchases.": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "Bengaluru techie's one irrational decision turned his business into a global brand in six years. 'Everyone thought I had lost it'Former Oracle India Operations Head Pradeep Kannan left his stable corporate job in Bengaluru in 2019 to return to his hometown, Karur, and start a small falooda and ice-cream outlet. Despite criticism and doubts from others, his venture — The Falooda Shop — …": {
    "show": false,
    "topic": "social",
    "importance": 1
  },
  "New Casio Pro Trek 30th anniversary watches with gold accents unveiledCasio is commemorating 30 years of its Pro Trek line with two special models, the PRW-61ANS-3 and PRG-340ANS-3, equipped with gold accents, memorial straps, and eco-friendly resin, priced at ¥69,500 and ¥39,500 respectively.": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "Bharat Narang on his role in Satyaa Sachee: Vikrant allows me to step out of my comfort zone and try something differentBharat Narang is set to captivate audiences as Vikrant in the upcoming show Satyaa Sachee. He describes the character as a disciplined police officer grappling with rigid personal beliefs inherited from his father, creating significant inner conflict.": {
    "show": false,
    "topic": "other",
    "importance": 1
  },
  "Ognissanti, in Spagna la visita ai cari defuntiepa12496868 Two people visit their late beloved ones at the cemetery of the town of Catarroja to mark All Saints Day, Valencia, eastern Spain, 01 November 2025. (ANSA)": {
    "show": false,
    "topic": "social",
    "importance": 1
  },
  "Urban Company revenues jump 37% even as it posts lossesUrban Company, which went public in September, saw its operating revenue increase 37% year-on-year (YoY) to Rs 380 crore for the quarter ending in September. The company posted a net loss of Rs 59 crore compared to Rs 1.8 crore in Q2FY25, largely due to a Rs …": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "8 ways to help your teams build lasting responsible AIMake responsible AI part of system design and deployment, not an afterthought. Industry experts offer guidelines for building and managing responsible applications.": {
    "show": false,
    "topic": "tech",
    "importance": 3
  },
  "Dogecoin Enters The Big Leagues — Stadium And Jerseys Get A Crypto MakeoverAccording to company releases and club statements, House of Doge and Brag House Holdings, Inc. have taken a major step into Italian football by becoming the largest equity holder in US Triestina Calcio 1918. Related Reading: Dogecoin Down 20% – But Some Think…": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "Louis Têtu: Why Canada has to get artificial intelligence rightAI is poised to create the most significant competitive divide of the past two centuries. Here's why Canada has to get it right. Read more.": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "ChatGPT Atlas AI Browser : The Future of Surfing the WebImagine a browser that doesn’t just help you surf the web but actively works alongside you, summarizing articles, automating repetitive tasks, and even remembering your preferences to streamline your day. OpenAI’s new browser, ChatGPT Atlas, promises to do ju…": {
    "show": false,
    "topic": "tech",
    "importance": 3
  },
  "A doctor’s fight to repair, not replaceAuthor note: This piece is based on a series of conversations with Dr. Meng Xu, one of China’s leading cardiac surgeons. His voice, vision, and uncompromising devotion to valve repair inspired every word. Though he prefers to remain out of the byline, his sto…": {
    "show": false,
    "topic": "science",
    "importance": 3
  },
  "Nvidia's dizzying week of dealmakingThe AI chip darling already has the most cutting-edge products and the best customers. The next thing to do is to find more of them.": {
    "show": true,
    "topic": "tech",
    "importance": 4
  },
  "My Hero Academia's Successor Is Already Here: Meet To Be Hero XThe future of superhero anime is here, and it is the perfect next-watch for fans of My Hero Academia who are looking for a new anime to binge.": {
    "show": false,
    "topic": "other",
    "importance": 1
  },
  "This open-source bookmarks sync tool just freed me from Google ChromeThis open-source tool lets you sync bookmarks across browsers and devices effortlessly": {
    "show": false,
    "topic": "tech",
    "importance": 1
  },
  "27 Shoes For Anyone Who Wants Comfy Feet But Doesn’t Want SneakersFor the days when you want to give your trusty New Balances a break.": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "'Mankeeping' Might Explain Why More Straight Women Are Staying SingleMen deserve opportunities to be vulnerable. But women are not an infinite resource for managing the emotions of men.": {
    "show": false,
    "topic": "social",
    "importance": 1
  },
  "Too Cold Or Dark Outside To Walk? Try This Instead.Fall and winter may limit your daily walks. Here are some expert-approved alternatives that help you get the same benefits.": {
    "show": false,
    "topic": "other",
    "importance": 1
  },
  "'Orthosomnia' Might Be Ruining Your Sleep. Here's What You Should Know.Technological advances in the wellness space have given rise to this paradoxical condition.": {
    "show": false,
    "topic": "other",
    "importance": 1
  },
  "These People ‘Convinced’ Their Partner To Have Kids. Here's How That Worked Out For Them.\"He didn't explicitly tell me no. I think that he tried to on our first date, but I maybe didn't want to hear it.\"": {
    "show": false,
    "topic": "social",
    "importance": 1
  },
  "Taiwan solar maker pushes storm-proof technology and niche strategy in U.S. and Japan marketsTaiwanese solar module maker TSEC is aiming to reposition itself amid ongoing geopolitical realignments. In remarks on October 29, 2025, TSEC executive vice president William Liao noted that the company has launched a flexible plan for global expansion of its…": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "Verizon is in crisis: Here’s what its new CEO must do to turn things aroundVerizon's new CEO makes some bold promises, but can Verizon really turn the ship around, or is this just empty talk?": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "Warning to rest of NFL: Davante Adams-Matthew Stafford attack heating up for RamsAs the Rams prepare to face the Saints, Davante Adams and Matthew Stafford seem to be on the cusp of achieving great things in the passing offense.": {
    "show": false,
    "topic": "other",
    "importance": 1
  },
  "The Slow Death of Special EducationThe government has abandoned its commitment to an equitable education for all children—if it ever had one.": {
    "show": false,
    "topic": "social",
    "importance": 3
  },
  "Self-Forgetfulness: George Kinder’s Key To Finding—And Being—A True FiduciaryHow self-forgetfulness separates true fiduciary advisors from the rest. George Kinder reveals the key to being—and finding—the real deal.": {
    "show": false,
    "topic": "finance",
    "importance": 2
  },
  "Your Moral Code Has Christian Roots Whether You Know It or NotMost people in our culture hold certain moral truths to be self-evident, and we see these views as basic moral common sense. But if we look at history, they’re not.": {
    "show": false,
    "topic": "social",
    "importance": 1
  },
  "Two Apple devices you really shouldn't buy this month (and 9 that are safe for now)Before you buy that shiny new Apple product, let's look at Apple's release plans. Plus, here's how you might be able to save money on the AirPods Pro 3.": {
    "show": false,
    "topic": "tech",
    "importance": 2
  },
  "Mutuum Finance (MUTM) Completes Roadmap Phase 1 as V1 Protocol Launch NearsDubai, UAE, Nov. 01, 2025 (GLOBE NEWSWIRE) -- Mutuum Finance (MUTM) has reached another major milestone in its development journey, successfully completing Phase 1 of its roadmap. With its V1 protocol launch now approaching on the Sepolia Testnet in Q4 2025, …": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "How Childhood Relationships Affect Your Adult Attachment Style, according to Large New StudyA large new study reveals how early relationships with parents and friends influence how we relate to those closest to us in adulthood": {
    "show": false,
    "topic": "social",
    "importance": 1
  },
  "Penn State vs. Ohio State prediction: Odds, picks, best bet for Big Ten clashPenn State will get a chance to spoil Ohio State's season Saturday.": {
    "show": false,
    "topic": "other",
    "importance": 1
  },
  "The ‘10 Martini’ Proof Connects Quantum Mechanics With Infinitely Intricate Mathematical StructuresThe proof, known to be so hard that a mathematician once offered 10 martinis to whoever could figure it out, uses number theory to explain quantum fractals.": {
    "show": false,
    "topic": "science",
    "importance": 1
  },
  "Meet Gen. Kenneth Wilsbach, the new US Air Force Chief of Staff: Massive challenges await him as he takes charge; a look at his career and challenges aheadGen. Kenneth Wilsbach assumes command of the Air Force amidst critical challenges in modernization and readiness. Experts highlight aging aircraft and reduced combat capacity, urging decisive action to reverse decline. Wilsbach acknowledges fiscal constraints…": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "YouTube CEO emphasizes AI as the next technological frontierYouTube reorganizes product and engineering around AI; introduces a voluntary exit program for U.S. staff.\nThe post YouTube CEO emphasizes AI as the next technological frontier appeared first on Studio by UXPin.": {
    "show": false,
    "topic": "tech",
    "importance": 3
  },
  "Ukraine Claims Successful Strike on Moscow Pipeline That Supplies Russian ForcesUkrainian forces hit an important fuel pipeline in the Moscow region that supplies the Russian army, Ukraine's military intelligence said Saturday, a claim that came amid a sustained Russian campaign of massive drone and missile attacks on Ukraine´s energy in…": {
    "show": true,
    "topic": "geopolitics",
    "importance": 5
  },
  "Istanbul Airport has sleep pods, therapy dogs, and the world's biggest terminal. Its CEO explains how it went from zero to the world's best in 5 years.Istanbul Airport opened just 33 hours after the old airport shut down in 2019. It's eyeing capacity expansions that could make it the world's busiest.": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "AR glasses blur the lines of when it’s obvious a company is collecting your data, privacy expert saysJoe Jones, director of research and insights at nonprofit privacy organization IAPP speaks about privacy concerns with AR glasses.": {
    "show": true,
    "topic": "tech",
    "importance": 4
  },
  "Parents are reverting to landline phones to stop their kids becoming smartphone addictsAs more parents try to limit their children’s screen time and keep them offline for as long as possible, many are turning back the clock — swapping smartphones for classic 1980s-style landlines. Amber Raiken explores why the retro phone is making a comeback a…": {
    "show": false,
    "topic": "social",
    "importance": 1
  },
  "Israel: Returned Remains of 3 Aren't HostagesThe remains of three people handed over by Hamas to the Red Cross this week don't belong to any of the hostages, Israel said Saturday, the latest development that could undermine the US-brokered agreement for a ceasefire in the Israel-Hamas war. The handover …": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "Siemens turns to software to manage AI’s power surgeThe rapid expansion of the semiconductor industry and artificial intelligence (AI) supply chains is driving a sharp increase in global electricity demand, raising new challenges for power system resilience. Industry experts warn that as AI data centers scale …": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "Microsoft Confirms Free Windows 10 Security Updates — How To Get ThemAlthough Windows 10 is no longer officially supported, Microsoft says users can now sign up for free security updates. Here’s what you need to do step-by-step.": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "Jensen Huang's Seoul dinner with Samsung, Hyundai chiefs sparks 'AI Korea' speculationNvidia CEO Jensen Huang met with Samsung chairman Lee Jae-yong and Hyundai Motor Group chairman Chung Eui-sun for a 70-minute dinner at Kkanbu Chicken in Seoul's Gangnam district on October 30, 2025. After the meal, the trio appeared together at the GeForce G…": {
    "show": true,
    "topic": "tech",
    "importance": 4
  },
  "The World Must Demand the Release of Palestinian Leader Marwan BarghoutiFor more than two decades, Marwan Barghouti has sat behind Israeli bars—a living emblem of a brutal occupation that has denied Palestinians their freedom and dignity. His continued imprisonment is not merely unjust; it silences the one leader most capable of …": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "How an 'accidental banker' is turning this LA-based investment bank into one of the biggest deal machinesBusiness Insider spoke with Houlihan Lokey's CEO about how he plans to ride the M&A rebound and the firm's recent hiring spree for managing directors.": {
    "show": false,
    "topic": "finance",
    "importance": 3
  },
  "What to Do in Portland, Oregon If You're Here for Business (2025)Work, eat, and play like a local with this business traveler's guide. Discover Portland’s best hotels, coworking spaces, and hidden gems worth your time.": {
    "show": false,
    "topic": "other",
    "importance": 1
  },
  "MLTX INVESTOR REMINDER: MoonLake Immunotherapeutics Investors may have been Affected by Fraud -- Contact BFA Law if You Suffered LossesMoonLake Immunotherapeutics investors that lost money are notified to contact BFA before the December 15, 2025 securities fraud class action deadline.......": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "Taiwan researchers develop tool to block harmful GenAI contentA team of researchers from National Taiwan University (NTU) has developed a technology that can precisely cut off generative AI models' associations with high-risk concepts. This innovation aims to make generative AI safer by preventing the generation of viol…": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "Leftward lurch: Second socialist leader ready to rule another iconic American citySeattle activist Katie Wilson leads incumbent Mayor Bruce Harrell in new polling as the city prepares to elect a socialist leader following New York's leftward shift.": {
    "show": true,
    "topic": "social",
    "importance": 4
  },
  "JHX INVESTOR REMINDER: James Hardie Industries plc Investors may have been Affected by Fraud -- Contact BFA Law if You Suffered LossesJames Hardie Industries plc investors that lost money are notified to contact BFA before the December 23, 2025 securities fraud class action deadline.......": {
    "show": false,
    "topic": "finance",
    "importance": 4
  },
  "MOH INVESTOR REMINDER: Molina Healthcare, Inc. Investors may have been Affected by Fraud -- Contact BFA Law if You Suffered LossesMolina Healthcare, Inc. investors that lost money are notified to contact BFA before the December 2, 2025 securities fraud class action deadline.......": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "Disney World Charging Guests $350 for New Year’s Eve at Magic Kingdom, Details RevealedFor the premium New Year’s Eve offering, Disney World guests had best open their wallets. Perched on the 15th floor of Disney’s Contemporary Resort, California Grill delivers one of Walt Disney World’s most memorable dining experiences. The restaurant pairs s…": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "The return of Erik PrinceErik Prince, America’s most infamous mercenary, is back.\nMr Prince rose to prominence during the war on terror as the founder of Blackwater, a private military company. The firm earned over a billion dollars providing armed personnel to various branches of th…": {
    "show": true,
    "topic": "geopolitics",
    "importance": 3
  },
  "IIT JAM 2026 form correction window opens: Submit changes by November 10 at joaps.iitb.ac.inIIT JAM 2026 applicants have a final opportunity to correct errors in their submitted forms. The correction window, closing November 10, 2025, allows edits to personal details, academic information, and exam city choices via the JOAPS portal. Ensure all chang…": {
    "show": false,
    "topic": "other",
    "importance": 1
  },
  "Louis Têtu: Why Canada has to get artificial intelligence rightThis past week, Canada’s AI Strategy Task Force gave Ottawa a set of recommendations to shape our country’s approach to \n \n \n \n \n \n \n \n \n \n artificial intelligence\n \n \n \n \n \n \n \n \n \n . This isn’t just another policy discussion; it’s about Canada’s economic fu…": {
    "show": true,
    "topic": "tech",
    "importance": 3
  },
  "Serbians mark anniversary of fatal station collapseMassive crowds gathered on Saturday in Novi Sad, Serbia, to mark the first anniversary of a railway station roof collapse that killed 16 people. The disaster, which occurred on November 1, 2024, has s...": {
    "show": true,
    "topic": "disaster",
    "importance": 3
  },
  "Berkshire worries grow as Buffett's CEO handover nearsTwo months from now Warren Buffett will no longer be Berkshire's CEO and investors appear to be getting increasingly nervous about the year-end transition.": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "Nigeria’s Dangote Says Fuel Output Now Exceeds Local Demand": {
    "show": true,
    "topic": "economy",
    "importance": 3
  },
  "When the AI bubble popsEvery tech company now seems to have their own AI: Google Gemini. OpenAI’s ChatGPT. MetaAI. Spending for AI is reaching record highs, powering a big boom for the stock market. Even the White House wants in on the fun.\nSo are we in an AI bubble — an overblown …": {
    "show": true,
    "topic": "tech",
    "importance": 4
  },
  "Is AI a Circular Money Machine? 3 Reasons Not to Worry": {
    "show": false,
    "topic": "other",
    "importance": 2
  }
}