{
  "Give up 'failed path' of armed struggle, join mainstream: Surrendered Naxal Bhupathi to comradesTop Naxalite Mallojula Venugopal Rao alias Bhupathi surrendered to Gadchiroli police. He appealed to active comrades to lay down arms and join the mainstream. Bhupathi stated that armed struggle has moved them away from people. He urged Maoists to leave viole…": {
    "show": true,
    "topic": "geopolitics",
    "importance": 3
  },
  "Woman Aghast as 14 Data Centers Move Next Door, Emits Terrible Stench\"I will die on this hill and stay in this house.\"\nThe post Woman Aghast as 14 Data Centers Move Next Door, Emits Terrible Stench appeared first on Futurism.": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "Overton Window Speedrun: British Voters Now More Right-Wing on Immigration Than AmericansVoters across the political spectrum in the UK are more likely to hold strong views on immigration and ethnic homogeneity than Americans.\nThe post Overton Window Speedrun: British Voters Now More Right-Wing on Immigration Than Americans appeared first on Brei…": {
    "show": true,
    "topic": "geopolitics",
    "importance": 4
  },
  "Nvidia emerges as TSMC's first A16 customer, while Apple may skip to A14Taiwan Semiconductor Manufacturing Company (TSMC) plans to launch its latest 1.6nm process, dubbed A16, in 2027. Reports indicate that Nvidia is currently working with TSMC on testing the A16 technology and is poised to become its inaugural adopter. In contra…": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "US urges ASEAN to be firm in countering China in the South China SeaU.S. Defense Secretary Pete Hegseth on Saturday urged Southeast Asian nations to stand firm and strengthen their maritime forces to counter China’s...": {
    "show": true,
    "topic": "geopolitics",
    "importance": 5
  },
  "I'm the CEO behind the New York Marathon. Here's how we pull off the world's biggest race.Rob Simmelkjaer, CEO of the nonprofit that puts on the New York City Marathon, said it's a miracle how the race comes together every year.": {
    "show": false,
    "topic": "other",
    "importance": 1
  },
  "Asean reaffirms 'no nukes' stance, says Defence MinisterKUALA LUMPUR: Asean reaffirms its no nuclear stance, says Datuk Seri Mohamed Khaled Nordin. Read full story": {
    "show": true,
    "topic": "geopolitics",
    "importance": 4
  },
  "Housing market inventory shift: 17 states where buyers are winning back powerWant more housing market stories from Lance Lambert’s ResiClub in your inbox? Subscribe to the ResiClub newsletter.\nWhen assessing home price momentum, ResiClub believes it’s important to monitor active listings and months of supply. If active listings start …": {
    "show": false,
    "topic": "other",
    "importance": 1
  },
  "BYD's October vehicle sales down 12% from year earlier": {
    "show": true,
    "topic": "tech",
    "importance": 2
  },
  "IonQ: Quantum Progress Meets Market RealityWhen I first analyzed IonQ (IONQ) it was a scientific frontrunner still searching for commercial validation. Since then, the stock has surged 113%, reflecting growing conviction in its execution and financial strength. The company raised 2025 guidance\nSummary…": {
    "show": false,
    "topic": "tech",
    "importance": 3
  },
  "Jamaican town reduced to rubble by Hurricane MelissaParadise turned to devastation The once-vibrant coastal town of Black River, Jamaica, has been transformed into what survivors are calling hell on Earth after Hurricane Melissa tore through the community with catastrophic force. The tropical paradise known fo…": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "Taiwan’s quantum talent gap widens as Dutch model highlights what’s missingAt a seminar held on April 28, 2025, by Taiwan's Industrial Technology Research Institute (ITRI), experts highlighted the stark contrast in quantum talent development and industry application between Taiwan and the Netherlands. Jeff Lin, general director of I…": {
    "show": true,
    "topic": "tech",
    "importance": 4
  },
  "BYD's October vehicle sales down 12% from year earlierBEIJING :Chinese automaker BYD said on Saturday its October sales dropped 12 per cent from the same month a year earlier to 441,706 vehicles.The update on global deliveries came in a post on Weibo by a BYD executive in charge of marketing and public relations…": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "This Simple Habit Can Improve Focus & Concentration, Study FindsPssst.... it's enjoyable, too.": {
    "show": false,
    "topic": "social",
    "importance": 1
  },
  "China signals easing of Nexperia chip export ban after talks with US, EU“We will comprehensively assess each enterprise’s specific circumstances and grant exemptions to those that meet the eligibility criteria,” the MOFCOM said on Saturday": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "Foreign Secretary speech at the 21st Manama Dialogue Conference in BahrainThe Foreign Secretary delivered a speech at the 21st Manama Dialogue Conference in Bahrain": {
    "show": true,
    "topic": "geopolitics",
    "importance": 4
  },
  "Taiwan analytics firm wins Canadian telecom deal, marking North American debutTaiwan's mobile data analytics firm Groundhog Technologies has successfully entered the North American market in the fourth quarter of 2025 by securing a contract with a leading Canadian telecom operator. The company continues to strengthen its presence in Ja…": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "Dalal Street Week Ahead: Technical charts signal bullish bias despite mild fatigueIndian markets traded rangebound last week, ending slightly lower. The Nifty broke a long-term trendline but faces resistance.  A truncated week ahead may see consolidation.  PSU Bank and Metal sectors are outperforming.  Participants should remain selectivel…": {
    "show": false,
    "topic": "finance",
    "importance": 2
  },
  "National Library prepares materials on nutrition to support MBGThe Indonesia National Library (Perpusnas) is preparing reading materials on nutrition to support national literacy improvement through the Free Nutritious ...": {
    "show": false,
    "topic": "other",
    "importance": 1
  },
  "Linux 6.18 Kernel Happenings, Python 3.14, NTFSPLUS & Other October HighlightsDuring the month of October on Phoronix were 305 original news articles around Linux/open-source and another 21 featured Linux hardware reviews / multi-page featured benchmark articles. There was an exciting mix of software and hardware happenings over the pa…": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "F&O Talk| Nifty logs 11 sessions of tight moves post 1,500-point rally. Here are the key levels Sudeep Shah is eyeingMarkets ended lower after a four-week rally due to profit-booking and mixed global signals. While broader indices showed strength, sectors like Auto and IT faced pressure. Analysts suggest PSU Banks, Oil & Gas, and Realty are poised for outperformance, with s…": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "NES Friday the 13th and NECA in The Daily LITG, 1st November, 2025NES Friday the 13th and NECA was the most-read story on Bleeding Cool yesterday, yet again. Lying In The Gutters is the daily runaround for the most-read stories the day before, as well as over the past seven years. Founded over sixteen years ago and steeped …": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "orq-ai-sdk 3.14.7Python Client SDK for the Orq API.": {
    "show": false,
    "topic": "tech",
    "importance": 1
  },
  "Inflation Rises in Turkey’s Biggest City Ahead of National Data": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "China's Xi pushes for global AI body at APEC in counter to U.S. - CNBCChina's Xi pushes for global AI body at APEC in counter to U.S.CNBC South Korea's Lee asks China's Xi for help engaging North KoreaNBC News APEC leaders wrap up summit after Trump and Xi reach truce in trade warAl Jazeera Xi, Lee Will Hold Talks in South Kore…": {
    "show": true,
    "topic": "geopolitics",
    "importance": 5
  },
  "On the island of Belene, Bulgarian communism’s forgotten prisonOn the Danube, between Bulgaria and Romania, Belene island once housed a prison camp for opponents of the Bulgarian Communist Party. Today, the island is home to an ordinary prison as well as a nature park – and what remains of some long-repressed memories.": {
    "show": true,
    "topic": "social",
    "importance": 2
  },
  "China signals easing of Nexperia semiconductor export ban - Financial TimesChina signals easing of Nexperia semiconductor export banFinancial Times China to loosen chip export ban to Europe following Netherlands rowBBC US to Announce Nexperia Chip Shipments From China to ResumeBloomberg Nexperia’s Chinese owner demands ousted CEO be…": {
    "show": true,
    "topic": "tech",
    "importance": 4
  },
  "US trade pact does not force M'sia into blind compliance, says Tengku ZafrulSHAH ALAM: The Reciprocal Trade Agreement (ART) between Malaysia and the United States (US) does not compel Malaysia to comply blindly, says Tngku Datuk Seri Zafrul Abdul Aziz, contradicting claims by Tan Sri Muhyiddin Yassin that it would force the country i…": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "Pet Health Products Market, By ApplicationSouth Korea Pet Health Products Market was valued at USD 1.2 Billion in 2022 and is projected to reach USD 2.": {
    "show": false,
    "topic": "other",
    "importance": 1
  },
  "The Brokerage That Makes More From Fewer Clients: Is Interactive Brokers Still Undervalued?With record equity, rising margin balances, and elite client engagement, Interactive Brokers continues to scale its model.": {
    "show": true,
    "topic": "finance",
    "importance": 4
  },
  "Man narrowly avoids disaster as 'one-in-a-billion' meteorite smashes into windscreen while driving brand new TeslaAustralian vet Dr Andrew Melville-Smith was driving his new Tesla home when a 'really violent explosion' rocked the car, burning a hole in his windcreen.": {
    "show": false,
    "topic": "disaster",
    "importance": 1
  },
  "Public school districts coast to coast adopting radical curriculum from org named for 60s radicalControversial Zinn Education Project curriculum adopted by 176,000+ teachers nationwide teaches American history through lens of racial oppression in public schools.": {
    "show": true,
    "topic": "social",
    "importance": 4
  },
  "Carney says he told Ontario premier not to run anti-tariff ad, apologized to TrumpGYEONGJU - Prime Minister Mark Carney says he told Ontario Premier Doug Ford that he didn't think the province should run the ad campaign that's being blamed for ending trade": {
    "show": true,
    "topic": "geopolitics",
    "importance": 3
  },
  "US offer of assistance to Asean must be based on ADMM frameworkKUALA LUMPUR: The United States' offer of cooperation to Asean must be based on the Asean Defence Ministers Meeting (ADMM) framework and the regional bloc centrality, says Datuk Seri Mohamed Khaled Nordin. Read full story": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "India’s net GST collection stays flat in October; gross up 4.6%The subdued growth reflects the impact of GST rate cuts effective September 22, following Prime Minister Modi’s August 15 announcement, which prompted consumers to delay purchases.": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "Bengaluru techie's one irrational decision turned his business into a global brand in six years. 'Everyone thought I had lost it'Former Oracle India Operations Head Pradeep Kannan left his stable corporate job in Bengaluru in 2019 to return to his hometown, Karur, and start a small falooda and ice-cream outlet. Despite criticism and doubts from others, his venture — The Falooda Shop — …": {
    "show": false,
    "topic": "social",
    "importance": 1
  },
  "New Casio Pro Trek 30th anniversary watches with gold accents unveiledCasio is commemorating 30 years of its Pro Trek line with two special models, the PRW-61ANS-3 and PRG-340ANS-3, equipped with gold accents, memorial straps, and eco-friendly resin, priced at ¥69,500 and ¥39,500 respectively.": {
    "show": false,
    "topic": "other",
    "importance": 2
  },
  "Bharat Narang on his role in Satyaa Sachee: Vikrant allows me to step out of my comfort zone and try something differentBharat Narang is set to captivate audiences as Vikrant in the upcoming show Satyaa Sachee. He describes the character as a disciplined police officer grappling with rigid personal beliefs inherited from his father, creating significant inner conflict.": {
    "show": false,
    "topic": "other",
    "importance": 1
  }
}